[M_Aster_PlotMission03 MissionDefinition]
MissionName="Pigeon ties"
MissionDescription="When change in The White Knight learns that Jack The Witcher has kidnapped the Queen of Flamerock, he proposes to stop it. [place]I am angry[-place], A bypass is also hidden in the Mage and Queen's Tower."
TurnInDescription="Kill the pair even if you find the nest [place]Cereal crops[-place] ceremony. After much violence and fighting, they reach Jack the Wizard's tower and come upon the trapped Queen.."
MissionSummary="My little boss."
MissionGiver="Roland"
MissionTurnInLocation="come over"
TeaserText=""

[M_Aster_PlotMission03:AncientPuzzleSolvedSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:AskAboutMagic MissionObjectiveDefinition]
ProgressMessage="Ask the witch about magic"

[M_Aster_PlotMission03:Breakspellovergreedtooth MissionObjectiveDefinition]
ProgressMessage="He freed Jagadatta from the curse"

[M_Aster_PlotMission03:CompleteJumpingPuzzle MissionObjectiveDefinition]
ProgressMessage="To walk on rough rock"

[M_Aster_PlotMission03:EnterGreedtoothsLair MissionObjectiveDefinition]
ProgressMessage="Look for sharp teeth"

[M_Aster_PlotMission03:EnterGreedtoothsLairSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:FindMineExitSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Find your way out of the mine."
MissionDescriptionOverride="After learning that Jack stole the Queen's Flamerock, the White Knight advises Roland to finish the job. [place]my accident[-place], Hopefully even the Queen will use the Witcher Tower hideout.<br><br>If all the priests hate you (with good reason if you killed their leader), you better find a way out of me.."

[M_Aster_PlotMission03:FindMineExitSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:FindPassphraseLetters MissionObjectiveDefinition]
ProgressMessage="please take the book"

[M_Aster_PlotMission03:FindTheDwarfLeaderSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Enter the ranks of the gnomes!."
MissionDescriptionOverride="It was later revealed that Jack the Wizard kidnapped the Queen of Palmrock, led by Roland Whiteknight. [place]light[-place], The shortcut leads to the hidden wizard's tower. This could be the queen's tower..<br><br>Jack the Wizard has always been a slave to cattle. So he needed a reason to kill him. Tina forms an alliance with the heroes to fight the witch.."

[M_Aster_PlotMission03:FindTheDwarfLeaderSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:FindtheDwarvenLeader MissionObjectiveDefinition]
ProgressMessage="Find the little king."

[M_Aster_PlotMission03:FindTheMineExit MissionObjectiveDefinition]
ProgressMessage="come out of me"

[M_Aster_PlotMission03:GetLettersSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Solve runes and small numbers to escape me.."
MissionDescriptionOverride="Learning that Jack's witch has kidnapped Queen Flamerock, blond Roland advises him to go alone. [place]my dream[-place], Hopefully the queen will be able to hide the shortcut to the witch tower like she did..<br><br>Since all the dwarves are angry with you (and since you killed their leader), you can make your way to the mine. Unfortunately, the wizard standing in front of the door blocked the only path to the Wizard's Keep..<br><br>A sad robot wizard named Claptrap asks you to find the dragon farm. While running or reading, the runner will give you a shortcut that takes you straight to the Magic Tower.."

[M_Aster_PlotMission03:GetLettersSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:GetLettersSet3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:HeadToTheDwarvenMines MissionObjectiveDefinition]
ProgressMessage="with narrow faces"

[M_Aster_PlotMission03:HeadToTheDwarvenMinesSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:JumpingPuzzleSolvedSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:KillGreedtooth MissionObjectiveDefinition]
ProgressMessage="Kill the Chaktooth"

[M_Aster_PlotMission03:KillGreedtoothSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:KillGreedtoothSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:KillSadisticOrcs MissionObjectiveDefinition]
ProgressMessage="Kill the orc monsters."

[M_Aster_PlotMission03:Mission3TunInSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:OpenDwarvenDoor MissionObjectiveDefinition]
ProgressMessage="Say "seven"."

[M_Aster_PlotMission03:Pass MissionObjectiveDefinition]
ProgressMessage="It happened"

[M_Aster_PlotMission03:PassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:PlaceTheRunes MissionObjectiveDefinition]
ProgressMessage="Place runes"

[M_Aster_PlotMission03:PlaceTheRunesSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Tell the elf the password and enter the wizard's tower.."
MissionDescriptionOverride="After learning that Jack the Wizard has kidnapped the Queen of Flamerock, he turns to the White Knight Roland for advice. [place]I'm greedy[-place], The witch's tower that the queen wanted was hidden there..<br><br>All the dwarves are angry with you (not without reason, since you killed their leader), so you need to find a way out of the mine. Unfortunately, the only shortcut to the Wizard's Tower is blocked by the dwarven gates..<br><br>We collected four shoelaces for consumption. Then you have to crack the password and say it out loud."

[M_Aster_PlotMission03:PlaceTheRunesSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:PunchPuzzle MissionObjectiveDefinition]
ProgressMessage="Kill the old puzzle."

[M_Aster_PlotMission03:PunchPuzzleSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:PunchTheDwarf MissionObjectiveDefinition]
ProgressMessage="Ragnar's attack"

[M_Aster_PlotMission03:PunchTheDwarfSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Game Deer Boss Battle online."
MissionDescriptionOverride="The White Knight Roland gives you this method after Jack learns that the Witch has stolen the Palm Queen. [place]my prey[-place], A short walk away is the Witch's Tower and Queen's Hope..<br><br>Jack is a wizard who captured witches a long time ago, so you have no reason to kill them. He advises Tina to join the group to fight the witch..<br><br>... Unfortunately, the main job is white and he has to decide what happens to the head of the law. He decided to beat her."

[M_Aster_PlotMission03:PuzzleEasierSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:PuzzleEasiestSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:SolvePuzzle MissionObjectiveDefinition]
ProgressMessage="Discover the secrets of vintage perfumes"

[M_Aster_PlotMission03:SolvePuzzleSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:StartJumpingPuzzleSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:TakeLastLetter MissionObjectiveDefinition]
ProgressMessage="Download the presentation about the detectors"

[M_Aster_PlotMission03:TakeLastLetterForRealSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:TakeLastLetterSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:TalkToDwarvenLeader MissionObjectiveDefinition]
ProgressMessage="Talk to Ragna."

[M_Aster_PlotMission03:TalkToLeaderSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:TalkToTheWizard MissionObjectiveDefinition]
ProgressMessage="Talk to the owner (verbally))"

[M_Aster_PlotMission03:TalkToTheWizardSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="talk to the teacher."
MissionDescriptionOverride="When Jack learns that the witch has stolen the Queen's Firestone, Roland orders the White Knight to follow him. [place]Greedy miner[-place], The queen wants to hide away from the wizard's tower..<br><br>Damn, they're all mad at you (yes, because you killed the president) and you'll find a better solution than me..<br><br>A witch can be seen from afar. They know the way.!"

[M_Aster_PlotMission03:TalkToTheWizardSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:TryRaftPassphrase MissionObjectiveDefinition]
ProgressMessage="Enter your password"

[M_Aster_PlotMission03:UnlockDoorExitMineSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:UnlockDoorExitMineSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_PlotMission03:UseTeleportReturnToExit MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

